ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_csd.h
/***************************************************************************//**
* \file cyip_csd.h
*
* \brief
* CSD IP definitions
*
* \note
* Generated 2/9/2017 by CyDeviceHeaderGenerator v1.1.0.47
* from the register map configuration rev#961378
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef _CYIP_CSD_H_
#define _CYIP_CSD_H_

#include "cyip_headers.h"

/* =========================================================================================================================== */
/* ================                                            CSD                                            ================ */
/* =========================================================================================================================== */

#define CSD_SECTION_SIZE            0x00001000UL

/**
  * \brief Capsense Controller (CSD)
  */
typedef struct {                                /*!< CSD Structure                                                             */
  __IOM uint32_t CONFIG;                        /*!< 0x00000000 Configuration and Control                                      */
  __IOM uint32_t SPARE;                         /*!< 0x00000004 Spare MMIO                                                     */
   __IM uint32_t RESERVED[30];
   __IM uint32_t STATUS;                        /*!< 0x00000080 Status Register                                                */
   __IM uint32_t STAT_SEQ;                      /*!< 0x00000084 Current Sequencer status                                       */
   __IM uint32_t STAT_CNTS;                     /*!< 0x00000088 Current status counts                                          */
   __IM uint32_t RESERVED1[17];
   __IM uint32_t RESULT_VAL1;                   /*!< 0x000000D0 Result CSD/CSX accumulation counter value 1                    */
   __IM uint32_t RESULT_VAL2;                   /*!< 0x000000D4 Result CSX accumulation counter value 2                        */
   __IM uint32_t RESERVED2[2];
   __IM uint32_t ADC_RES;                       /*!< 0x000000E0 ADC measurement                                                */
   __IM uint32_t RESERVED3[3];
  __IOM uint32_t INTR;                          /*!< 0x000000F0 CSD Interrupt Request Register                                 */
  __IOM uint32_t INTR_SET;                      /*!< 0x000000F4 CSD Interrupt set register                                     */
  __IOM uint32_t INTR_MASK;                     /*!< 0x000000F8 CSD Interrupt mask register                                    */
   __IM uint32_t INTR_MASKED;                   /*!< 0x000000FC CSD Interrupt masked register                                  */
   __IM uint32_t RESERVED4[32];
  __IOM uint32_t HSCMP;                         /*!< 0x00000180 High Speed Comparator configuration                            */
  __IOM uint32_t AMBUF;                         /*!< 0x00000184 Reference Generator configuration                              */
  __IOM uint32_t REFGEN;                        /*!< 0x00000188 Reference Generator configuration                              */
  __IOM uint32_t CSDCMP;                        /*!< 0x0000018C CSD Comparator configuration                                   */
   __IM uint32_t RESERVED5[24];
  __IOM uint32_t SW_RES;                        /*!< 0x000001F0 Switch Resistance configuration                                */
   __IM uint32_t RESERVED6[3];
  __IOM uint32_t SENSE_PERIOD;                  /*!< 0x00000200 Sense clock period                                             */
  __IOM uint32_t SENSE_DUTY;                    /*!< 0x00000204 Sense clock duty cycle                                         */
   __IM uint32_t RESERVED7[30];
  __IOM uint32_t SW_HS_P_SEL;                   /*!< 0x00000280 HSCMP Pos input switch Waveform selection                      */
  __IOM uint32_t SW_HS_N_SEL;                   /*!< 0x00000284 HSCMP Neg input switch Waveform selection                      */
  __IOM uint32_t SW_SHIELD_SEL;                 /*!< 0x00000288 Shielding switches Waveform selection                          */
   __IM uint32_t RESERVED8;
  __IOM uint32_t SW_AMUXBUF_SEL;                /*!< 0x00000290 Amuxbuffer switches Waveform selection                         */
  __IOM uint32_t SW_BYP_SEL;                    /*!< 0x00000294 AMUXBUS bypass switches Waveform selection                     */
   __IM uint32_t RESERVED9[2];
  __IOM uint32_t SW_CMP_P_SEL;                  /*!< 0x000002A0 CSDCMP Pos Switch Waveform selection                           */
  __IOM uint32_t SW_CMP_N_SEL;                  /*!< 0x000002A4 CSDCMP Neg Switch Waveform selection                           */
  __IOM uint32_t SW_REFGEN_SEL;                 /*!< 0x000002A8 Reference Generator Switch Waveform selection                  */
   __IM uint32_t RESERVED10;
  __IOM uint32_t SW_FW_MOD_SEL;                 /*!< 0x000002B0 Full Wave Cmod Switch Waveform selection                       */
  __IOM uint32_t SW_FW_TANK_SEL;                /*!< 0x000002B4 Full Wave Csh_tank Switch Waveform selection                   */
   __IM uint32_t RESERVED11[2];
  __IOM uint32_t SW_DSI_SEL;                    /*!< 0x000002C0 DSI output switch control Waveform selection                   */
   __IM uint32_t RESERVED12[3];
  __IOM uint32_t IO_SEL;                        /*!< 0x000002D0 IO output control Waveform selection                           */
   __IM uint32_t RESERVED13[11];
  __IOM uint32_t SEQ_TIME;                      /*!< 0x00000300 Sequencer Timing                                               */
   __IM uint32_t RESERVED14[3];
  __IOM uint32_t SEQ_INIT_CNT;                  /*!< 0x00000310 Sequencer Initial conversion and sample counts                 */
  __IOM uint32_t SEQ_NORM_CNT;                  /*!< 0x00000314 Sequencer Normal conversion and sample counts                  */
   __IM uint32_t RESERVED15[2];
  __IOM uint32_t ADC_CTL;                       /*!< 0x00000320 ADC Control                                                    */
   __IM uint32_t RESERVED16[7];
  __IOM uint32_t SEQ_START;                     /*!< 0x00000340 Sequencer start                                                */
   __IM uint32_t RESERVED17[47];
  __IOM uint32_t IDACA;                         /*!< 0x00000400 IDACA Configuration                                            */
   __IM uint32_t RESERVED18[63];
  __IOM uint32_t IDACB;                         /*!< 0x00000500 IDACB Configuration                                            */
} CSD_Type;                                     /*!< Size = 1284 (0x504)                                                       */


