ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_csd.h
/* ======================================================  CSD.CONFIG  ======================================================= */
#define CSD_CONFIG_IREF_SEL_Pos           (0UL)                 /*!< CSD CONFIG: IREF_SEL (Bit 0)                              */
#define CSD_CONFIG_IREF_SEL_Msk           (0x1UL)               /*!< CSD CONFIG: IREF_SEL (Bitfield-Mask: 0x01)                */
#define CSD_CONFIG_FILTER_DELAY_Pos       (4UL)                 /*!< CSD CONFIG: FILTER_DELAY (Bit 4)                          */
#define CSD_CONFIG_FILTER_DELAY_Msk       (0x1f0UL)             /*!< CSD CONFIG: FILTER_DELAY (Bitfield-Mask: 0x1f)            */
#define CSD_CONFIG_SHIELD_DELAY_Pos       (10UL)                /*!< CSD CONFIG: SHIELD_DELAY (Bit 10)                         */
#define CSD_CONFIG_SHIELD_DELAY_Msk       (0xc00UL)             /*!< CSD CONFIG: SHIELD_DELAY (Bitfield-Mask: 0x03)            */
#define CSD_CONFIG_SENSE_EN_Pos           (12UL)                /*!< CSD CONFIG: SENSE_EN (Bit 12)                             */
#define CSD_CONFIG_SENSE_EN_Msk           (0x1000UL)            /*!< CSD CONFIG: SENSE_EN (Bitfield-Mask: 0x01)                */
#define CSD_CONFIG_FULL_WAVE_Pos          (17UL)                /*!< CSD CONFIG: FULL_WAVE (Bit 17)                            */
#define CSD_CONFIG_FULL_WAVE_Msk          (0x20000UL)           /*!< CSD CONFIG: FULL_WAVE (Bitfield-Mask: 0x01)               */
#define CSD_CONFIG_MUTUAL_CAP_Pos         (18UL)                /*!< CSD CONFIG: MUTUAL_CAP (Bit 18)                           */
#define CSD_CONFIG_MUTUAL_CAP_Msk         (0x40000UL)           /*!< CSD CONFIG: MUTUAL_CAP (Bitfield-Mask: 0x01)              */
#define CSD_CONFIG_CSX_DUAL_CNT_Pos       (19UL)                /*!< CSD CONFIG: CSX_DUAL_CNT (Bit 19)                         */
#define CSD_CONFIG_CSX_DUAL_CNT_Msk       (0x80000UL)           /*!< CSD CONFIG: CSX_DUAL_CNT (Bitfield-Mask: 0x01)            */
#define CSD_CONFIG_DSI_COUNT_SEL_Pos      (24UL)                /*!< CSD CONFIG: DSI_COUNT_SEL (Bit 24)                        */
#define CSD_CONFIG_DSI_COUNT_SEL_Msk      (0x1000000UL)         /*!< CSD CONFIG: DSI_COUNT_SEL (Bitfield-Mask: 0x01)           */
#define CSD_CONFIG_DSI_SAMPLE_EN_Pos      (25UL)                /*!< CSD CONFIG: DSI_SAMPLE_EN (Bit 25)                        */
#define CSD_CONFIG_DSI_SAMPLE_EN_Msk      (0x2000000UL)         /*!< CSD CONFIG: DSI_SAMPLE_EN (Bitfield-Mask: 0x01)           */
#define CSD_CONFIG_SAMPLE_SYNC_Pos        (26UL)                /*!< CSD CONFIG: SAMPLE_SYNC (Bit 26)                          */
#define CSD_CONFIG_SAMPLE_SYNC_Msk        (0x4000000UL)         /*!< CSD CONFIG: SAMPLE_SYNC (Bitfield-Mask: 0x01)             */
#define CSD_CONFIG_DSI_SENSE_EN_Pos       (27UL)                /*!< CSD CONFIG: DSI_SENSE_EN (Bit 27)                         */
#define CSD_CONFIG_DSI_SENSE_EN_Msk       (0x8000000UL)         /*!< CSD CONFIG: DSI_SENSE_EN (Bitfield-Mask: 0x01)            */
#define CSD_CONFIG_LP_MODE_Pos            (30UL)                /*!< CSD CONFIG: LP_MODE (Bit 30)                              */
#define CSD_CONFIG_LP_MODE_Msk            (0x40000000UL)        /*!< CSD CONFIG: LP_MODE (Bitfield-Mask: 0x01)                 */
#define CSD_CONFIG_ENABLE_Pos             (31UL)                /*!< CSD CONFIG: ENABLE (Bit 31)                               */
#define CSD_CONFIG_ENABLE_Msk             (0x80000000UL)        /*!< CSD CONFIG: ENABLE (Bitfield-Mask: 0x01)                  */
/* =======================================================  CSD.SPARE  ======================================================= */
#define CSD_SPARE_SPARE_Pos               (0UL)                 /*!< CSD SPARE: SPARE (Bit 0)                                  */
#define CSD_SPARE_SPARE_Msk               (0xfUL)               /*!< CSD SPARE: SPARE (Bitfield-Mask: 0x0f)                    */
/* ======================================================  CSD.STATUS  ======================================================= */
#define CSD_STATUS_CSD_SENSE_Pos          (1UL)                 /*!< CSD STATUS: CSD_SENSE (Bit 1)                             */
#define CSD_STATUS_CSD_SENSE_Msk          (0x2UL)               /*!< CSD STATUS: CSD_SENSE (Bitfield-Mask: 0x01)               */
#define CSD_STATUS_HSCMP_OUT_Pos          (2UL)                 /*!< CSD STATUS: HSCMP_OUT (Bit 2)                             */
#define CSD_STATUS_HSCMP_OUT_Msk          (0x4UL)               /*!< CSD STATUS: HSCMP_OUT (Bitfield-Mask: 0x01)               */
#define CSD_STATUS_CSDCMP_OUT_Pos         (3UL)                 /*!< CSD STATUS: CSDCMP_OUT (Bit 3)                            */
#define CSD_STATUS_CSDCMP_OUT_Msk         (0x8UL)               /*!< CSD STATUS: CSDCMP_OUT (Bitfield-Mask: 0x01)              */
/* =====================================================  CSD.STAT_SEQ  ====================================================== */
#define CSD_STAT_SEQ_SEQ_STATE_Pos        (0UL)                 /*!< CSD STAT_SEQ: SEQ_STATE (Bit 0)                           */
#define CSD_STAT_SEQ_SEQ_STATE_Msk        (0x7UL)               /*!< CSD STAT_SEQ: SEQ_STATE (Bitfield-Mask: 0x07)             */
#define CSD_STAT_SEQ_ADC_STATE_Pos        (16UL)                /*!< CSD STAT_SEQ: ADC_STATE (Bit 16)                          */
#define CSD_STAT_SEQ_ADC_STATE_Msk        (0x70000UL)           /*!< CSD STAT_SEQ: ADC_STATE (Bitfield-Mask: 0x07)             */
/* =====================================================  CSD.STAT_CNTS  ===================================================== */
#define CSD_STAT_CNTS_NUM_CONV_Pos        (0UL)                 /*!< CSD STAT_CNTS: NUM_CONV (Bit 0)                           */
#define CSD_STAT_CNTS_NUM_CONV_Msk        (0xffffUL)            /*!< CSD STAT_CNTS: NUM_CONV (Bitfield-Mask: 0xffff)           */
/* ====================================================  CSD.RESULT_VAL1  ==================================================== */
#define CSD_RESULT_VAL1_VALUE_Pos         (0UL)                 /*!< CSD RESULT_VAL1: VALUE (Bit 0)                            */
#define CSD_RESULT_VAL1_VALUE_Msk         (0xffffUL)            /*!< CSD RESULT_VAL1: VALUE (Bitfield-Mask: 0xffff)            */
#define CSD_RESULT_VAL1_BAD_CONVS_Pos     (16UL)                /*!< CSD RESULT_VAL1: BAD_CONVS (Bit 16)                       */
#define CSD_RESULT_VAL1_BAD_CONVS_Msk     (0xff0000UL)          /*!< CSD RESULT_VAL1: BAD_CONVS (Bitfield-Mask: 0xff)          */
/* ====================================================  CSD.RESULT_VAL2  ==================================================== */
#define CSD_RESULT_VAL2_VALUE_Pos         (0UL)                 /*!< CSD RESULT_VAL2: VALUE (Bit 0)                            */
#define CSD_RESULT_VAL2_VALUE_Msk         (0xffffUL)            /*!< CSD RESULT_VAL2: VALUE (Bitfield-Mask: 0xffff)            */
/* ======================================================  CSD.ADC_RES  ====================================================== */
#define CSD_ADC_RES_VIN_CNT_Pos           (0UL)                 /*!< CSD ADC_RES: VIN_CNT (Bit 0)                              */
#define CSD_ADC_RES_VIN_CNT_Msk           (0xffffUL)            /*!< CSD ADC_RES: VIN_CNT (Bitfield-Mask: 0xffff)              */
#define CSD_ADC_RES_HSCMP_POL_Pos         (16UL)                /*!< CSD ADC_RES: HSCMP_POL (Bit 16)                           */
#define CSD_ADC_RES_HSCMP_POL_Msk         (0x10000UL)           /*!< CSD ADC_RES: HSCMP_POL (Bitfield-Mask: 0x01)              */
#define CSD_ADC_RES_ADC_OVERFLOW_Pos      (30UL)                /*!< CSD ADC_RES: ADC_OVERFLOW (Bit 30)                        */
#define CSD_ADC_RES_ADC_OVERFLOW_Msk      (0x40000000UL)        /*!< CSD ADC_RES: ADC_OVERFLOW (Bitfield-Mask: 0x01)           */
#define CSD_ADC_RES_ADC_ABORT_Pos         (31UL)                /*!< CSD ADC_RES: ADC_ABORT (Bit 31)                           */
#define CSD_ADC_RES_ADC_ABORT_Msk         (0x80000000UL)        /*!< CSD ADC_RES: ADC_ABORT (Bitfield-Mask: 0x01)              */
/* =======================================================  CSD.INTR  ======================================================== */
#define CSD_INTR_SAMPLE_Pos               (1UL)                 /*!< CSD INTR: SAMPLE (Bit 1)                                  */
#define CSD_INTR_SAMPLE_Msk               (0x2UL)               /*!< CSD INTR: SAMPLE (Bitfield-Mask: 0x01)                    */
#define CSD_INTR_INIT_Pos                 (2UL)                 /*!< CSD INTR: INIT (Bit 2)                                    */
#define CSD_INTR_INIT_Msk                 (0x4UL)               /*!< CSD INTR: INIT (Bitfield-Mask: 0x01)                      */
#define CSD_INTR_ADC_RES_Pos              (8UL)                 /*!< CSD INTR: ADC_RES (Bit 8)                                 */
#define CSD_INTR_ADC_RES_Msk              (0x100UL)             /*!< CSD INTR: ADC_RES (Bitfield-Mask: 0x01)                   */
/* =====================================================  CSD.INTR_SET  ====================================================== */
#define CSD_INTR_SET_SAMPLE_Pos           (1UL)                 /*!< CSD INTR_SET: SAMPLE (Bit 1)                              */
#define CSD_INTR_SET_SAMPLE_Msk           (0x2UL)               /*!< CSD INTR_SET: SAMPLE (Bitfield-Mask: 0x01)                */
#define CSD_INTR_SET_INIT_Pos             (2UL)                 /*!< CSD INTR_SET: INIT (Bit 2)                                */
#define CSD_INTR_SET_INIT_Msk             (0x4UL)               /*!< CSD INTR_SET: INIT (Bitfield-Mask: 0x01)                  */
#define CSD_INTR_SET_ADC_RES_Pos          (8UL)                 /*!< CSD INTR_SET: ADC_RES (Bit 8)                             */
#define CSD_INTR_SET_ADC_RES_Msk          (0x100UL)             /*!< CSD INTR_SET: ADC_RES (Bitfield-Mask: 0x01)               */
/* =====================================================  CSD.INTR_MASK  ===================================================== */
#define CSD_INTR_MASK_SAMPLE_Pos          (1UL)                 /*!< CSD INTR_MASK: SAMPLE (Bit 1)                             */
#define CSD_INTR_MASK_SAMPLE_Msk          (0x2UL)               /*!< CSD INTR_MASK: SAMPLE (Bitfield-Mask: 0x01)               */
#define CSD_INTR_MASK_INIT_Pos            (2UL)                 /*!< CSD INTR_MASK: INIT (Bit 2)                               */
#define CSD_INTR_MASK_INIT_Msk            (0x4UL)               /*!< CSD INTR_MASK: INIT (Bitfield-Mask: 0x01)                 */
#define CSD_INTR_MASK_ADC_RES_Pos         (8UL)                 /*!< CSD INTR_MASK: ADC_RES (Bit 8)                            */
#define CSD_INTR_MASK_ADC_RES_Msk         (0x100UL)             /*!< CSD INTR_MASK: ADC_RES (Bitfield-Mask: 0x01)              */
/* ====================================================  CSD.INTR_MASKED  ==================================================== */
#define CSD_INTR_MASKED_SAMPLE_Pos        (1UL)                 /*!< CSD INTR_MASKED: SAMPLE (Bit 1)                           */
#define CSD_INTR_MASKED_SAMPLE_Msk        (0x2UL)               /*!< CSD INTR_MASKED: SAMPLE (Bitfield-Mask: 0x01)             */
#define CSD_INTR_MASKED_INIT_Pos          (2UL)                 /*!< CSD INTR_MASKED: INIT (Bit 2)                             */
#define CSD_INTR_MASKED_INIT_Msk          (0x4UL)               /*!< CSD INTR_MASKED: INIT (Bitfield-Mask: 0x01)               */
#define CSD_INTR_MASKED_ADC_RES_Pos       (8UL)                 /*!< CSD INTR_MASKED: ADC_RES (Bit 8)                          */
#define CSD_INTR_MASKED_ADC_RES_Msk       (0x100UL)             /*!< CSD INTR_MASKED: ADC_RES (Bitfield-Mask: 0x01)            */
/* =======================================================  CSD.HSCMP  ======================================================= */
#define CSD_HSCMP_HSCMP_EN_Pos            (0UL)                 /*!< CSD HSCMP: HSCMP_EN (Bit 0)                               */
#define CSD_HSCMP_HSCMP_EN_Msk            (0x1UL)               /*!< CSD HSCMP: HSCMP_EN (Bitfield-Mask: 0x01)                 */
#define CSD_HSCMP_HSCMP_INVERT_Pos        (4UL)                 /*!< CSD HSCMP: HSCMP_INVERT (Bit 4)                           */
#define CSD_HSCMP_HSCMP_INVERT_Msk        (0x10UL)              /*!< CSD HSCMP: HSCMP_INVERT (Bitfield-Mask: 0x01)             */
#define CSD_HSCMP_AZ_EN_Pos               (31UL)                /*!< CSD HSCMP: AZ_EN (Bit 31)                                 */
#define CSD_HSCMP_AZ_EN_Msk               (0x80000000UL)        /*!< CSD HSCMP: AZ_EN (Bitfield-Mask: 0x01)                    */
/* =======================================================  CSD.AMBUF  ======================================================= */
#define CSD_AMBUF_PWR_MODE_Pos            (0UL)                 /*!< CSD AMBUF: PWR_MODE (Bit 0)                               */
#define CSD_AMBUF_PWR_MODE_Msk            (0x3UL)               /*!< CSD AMBUF: PWR_MODE (Bitfield-Mask: 0x03)                 */
/* ======================================================  CSD.REFGEN  ======================================================= */
#define CSD_REFGEN_REFGEN_EN_Pos          (0UL)                 /*!< CSD REFGEN: REFGEN_EN (Bit 0)                             */
#define CSD_REFGEN_REFGEN_EN_Msk          (0x1UL)               /*!< CSD REFGEN: REFGEN_EN (Bitfield-Mask: 0x01)               */
#define CSD_REFGEN_BYPASS_Pos             (4UL)                 /*!< CSD REFGEN: BYPASS (Bit 4)                                */
#define CSD_REFGEN_BYPASS_Msk             (0x10UL)              /*!< CSD REFGEN: BYPASS (Bitfield-Mask: 0x01)                  */
#define CSD_REFGEN_VDDA_EN_Pos            (5UL)                 /*!< CSD REFGEN: VDDA_EN (Bit 5)                               */
#define CSD_REFGEN_VDDA_EN_Msk            (0x20UL)              /*!< CSD REFGEN: VDDA_EN (Bitfield-Mask: 0x01)                 */
#define CSD_REFGEN_RES_EN_Pos             (6UL)                 /*!< CSD REFGEN: RES_EN (Bit 6)                                */
#define CSD_REFGEN_RES_EN_Msk             (0x40UL)              /*!< CSD REFGEN: RES_EN (Bitfield-Mask: 0x01)                  */
#define CSD_REFGEN_GAIN_Pos               (8UL)                 /*!< CSD REFGEN: GAIN (Bit 8)                                  */
#define CSD_REFGEN_GAIN_Msk               (0x1f00UL)            /*!< CSD REFGEN: GAIN (Bitfield-Mask: 0x1f)                    */
#define CSD_REFGEN_VREFLO_SEL_Pos         (16UL)                /*!< CSD REFGEN: VREFLO_SEL (Bit 16)                           */
#define CSD_REFGEN_VREFLO_SEL_Msk         (0x1f0000UL)          /*!< CSD REFGEN: VREFLO_SEL (Bitfield-Mask: 0x1f)              */
#define CSD_REFGEN_VREFLO_INT_Pos         (23UL)                /*!< CSD REFGEN: VREFLO_INT (Bit 23)                           */
#define CSD_REFGEN_VREFLO_INT_Msk         (0x800000UL)          /*!< CSD REFGEN: VREFLO_INT (Bitfield-Mask: 0x01)              */
/* ======================================================  CSD.CSDCMP  ======================================================= */
#define CSD_CSDCMP_CSDCMP_EN_Pos          (0UL)                 /*!< CSD CSDCMP: CSDCMP_EN (Bit 0)                             */
#define CSD_CSDCMP_CSDCMP_EN_Msk          (0x1UL)               /*!< CSD CSDCMP: CSDCMP_EN (Bitfield-Mask: 0x01)               */
#define CSD_CSDCMP_POLARITY_SEL_Pos       (4UL)                 /*!< CSD CSDCMP: POLARITY_SEL (Bit 4)                          */
#define CSD_CSDCMP_POLARITY_SEL_Msk       (0x30UL)              /*!< CSD CSDCMP: POLARITY_SEL (Bitfield-Mask: 0x03)            */
#define CSD_CSDCMP_CMP_PHASE_Pos          (8UL)                 /*!< CSD CSDCMP: CMP_PHASE (Bit 8)                             */
#define CSD_CSDCMP_CMP_PHASE_Msk          (0x300UL)             /*!< CSD CSDCMP: CMP_PHASE (Bitfield-Mask: 0x03)               */
#define CSD_CSDCMP_CMP_MODE_Pos           (28UL)                /*!< CSD CSDCMP: CMP_MODE (Bit 28)                             */
#define CSD_CSDCMP_CMP_MODE_Msk           (0x10000000UL)        /*!< CSD CSDCMP: CMP_MODE (Bitfield-Mask: 0x01)                */
#define CSD_CSDCMP_FEEDBACK_MODE_Pos      (29UL)                /*!< CSD CSDCMP: FEEDBACK_MODE (Bit 29)                        */
#define CSD_CSDCMP_FEEDBACK_MODE_Msk      (0x20000000UL)        /*!< CSD CSDCMP: FEEDBACK_MODE (Bitfield-Mask: 0x01)           */
#define CSD_CSDCMP_AZ_EN_Pos              (31UL)                /*!< CSD CSDCMP: AZ_EN (Bit 31)                                */
#define CSD_CSDCMP_AZ_EN_Msk              (0x80000000UL)        /*!< CSD CSDCMP: AZ_EN (Bitfield-Mask: 0x01)                   */
/* ======================================================  CSD.SW_RES  ======================================================= */
#define CSD_SW_RES_RES_HCAV_Pos           (0UL)                 /*!< CSD SW_RES: RES_HCAV (Bit 0)                              */
#define CSD_SW_RES_RES_HCAV_Msk           (0x3UL)               /*!< CSD SW_RES: RES_HCAV (Bitfield-Mask: 0x03)                */
#define CSD_SW_RES_RES_HCAG_Pos           (2UL)                 /*!< CSD SW_RES: RES_HCAG (Bit 2)                              */
#define CSD_SW_RES_RES_HCAG_Msk           (0xcUL)               /*!< CSD SW_RES: RES_HCAG (Bitfield-Mask: 0x03)                */
#define CSD_SW_RES_RES_HCBV_Pos           (4UL)                 /*!< CSD SW_RES: RES_HCBV (Bit 4)                              */
#define CSD_SW_RES_RES_HCBV_Msk           (0x30UL)              /*!< CSD SW_RES: RES_HCBV (Bitfield-Mask: 0x03)                */
#define CSD_SW_RES_RES_HCBG_Pos           (6UL)                 /*!< CSD SW_RES: RES_HCBG (Bit 6)                              */
#define CSD_SW_RES_RES_HCBG_Msk           (0xc0UL)              /*!< CSD SW_RES: RES_HCBG (Bitfield-Mask: 0x03)                */
#define CSD_SW_RES_RES_F1PM_Pos           (16UL)                /*!< CSD SW_RES: RES_F1PM (Bit 16)                             */
#define CSD_SW_RES_RES_F1PM_Msk           (0x30000UL)           /*!< CSD SW_RES: RES_F1PM (Bitfield-Mask: 0x03)                */
#define CSD_SW_RES_RES_F2PT_Pos           (18UL)                /*!< CSD SW_RES: RES_F2PT (Bit 18)                             */
#define CSD_SW_RES_RES_F2PT_Msk           (0xc0000UL)           /*!< CSD SW_RES: RES_F2PT (Bitfield-Mask: 0x03)                */
/* ===================================================  CSD.SENSE_PERIOD  ==================================================== */
#define CSD_SENSE_PERIOD_SENSE_DIV_Pos    (0UL)                 /*!< CSD SENSE_PERIOD: SENSE_DIV (Bit 0)                       */
#define CSD_SENSE_PERIOD_SENSE_DIV_Msk    (0xfffUL)             /*!< CSD SENSE_PERIOD: SENSE_DIV (Bitfield-Mask: 0xfff)        */
#define CSD_SENSE_PERIOD_LFSR_SIZE_Pos    (16UL)                /*!< CSD SENSE_PERIOD: LFSR_SIZE (Bit 16)                      */
#define CSD_SENSE_PERIOD_LFSR_SIZE_Msk    (0x70000UL)           /*!< CSD SENSE_PERIOD: LFSR_SIZE (Bitfield-Mask: 0x07)         */
#define CSD_SENSE_PERIOD_LFSR_SCALE_Pos   (20UL)                /*!< CSD SENSE_PERIOD: LFSR_SCALE (Bit 20)                     */
#define CSD_SENSE_PERIOD_LFSR_SCALE_Msk   (0xf00000UL)          /*!< CSD SENSE_PERIOD: LFSR_SCALE (Bitfield-Mask: 0x0f)        */
#define CSD_SENSE_PERIOD_LFSR_CLEAR_Pos   (24UL)                /*!< CSD SENSE_PERIOD: LFSR_CLEAR (Bit 24)                     */
#define CSD_SENSE_PERIOD_LFSR_CLEAR_Msk   (0x1000000UL)         /*!< CSD SENSE_PERIOD: LFSR_CLEAR (Bitfield-Mask: 0x01)        */
#define CSD_SENSE_PERIOD_SEL_LFSR_MSB_Pos (25UL)                /*!< CSD SENSE_PERIOD: SEL_LFSR_MSB (Bit 25)                   */
#define CSD_SENSE_PERIOD_SEL_LFSR_MSB_Msk (0x2000000UL)         /*!< CSD SENSE_PERIOD: SEL_LFSR_MSB (Bitfield-Mask: 0x01)      */
#define CSD_SENSE_PERIOD_LFSR_BITS_Pos    (26UL)                /*!< CSD SENSE_PERIOD: LFSR_BITS (Bit 26)                      */
#define CSD_SENSE_PERIOD_LFSR_BITS_Msk    (0xc000000UL)         /*!< CSD SENSE_PERIOD: LFSR_BITS (Bitfield-Mask: 0x03)         */
/* ====================================================  CSD.SENSE_DUTY  ===================================================== */
#define CSD_SENSE_DUTY_SENSE_WIDTH_Pos    (0UL)                 /*!< CSD SENSE_DUTY: SENSE_WIDTH (Bit 0)                       */
#define CSD_SENSE_DUTY_SENSE_WIDTH_Msk    (0xfffUL)             /*!< CSD SENSE_DUTY: SENSE_WIDTH (Bitfield-Mask: 0xfff)        */
#define CSD_SENSE_DUTY_SENSE_POL_Pos      (16UL)                /*!< CSD SENSE_DUTY: SENSE_POL (Bit 16)                        */
#define CSD_SENSE_DUTY_SENSE_POL_Msk      (0x10000UL)           /*!< CSD SENSE_DUTY: SENSE_POL (Bitfield-Mask: 0x01)           */
#define CSD_SENSE_DUTY_OVERLAP_PHI1_Pos   (18UL)                /*!< CSD SENSE_DUTY: OVERLAP_PHI1 (Bit 18)                     */
#define CSD_SENSE_DUTY_OVERLAP_PHI1_Msk   (0x40000UL)           /*!< CSD SENSE_DUTY: OVERLAP_PHI1 (Bitfield-Mask: 0x01)        */
#define CSD_SENSE_DUTY_OVERLAP_PHI2_Pos   (19UL)                /*!< CSD SENSE_DUTY: OVERLAP_PHI2 (Bit 19)                     */
#define CSD_SENSE_DUTY_OVERLAP_PHI2_Msk   (0x80000UL)           /*!< CSD SENSE_DUTY: OVERLAP_PHI2 (Bitfield-Mask: 0x01)        */
/* ====================================================  CSD.SW_HS_P_SEL  ==================================================== */
#define CSD_SW_HS_P_SEL_SW_HMPM_Pos       (0UL)                 /*!< CSD SW_HS_P_SEL: SW_HMPM (Bit 0)                          */
#define CSD_SW_HS_P_SEL_SW_HMPM_Msk       (0x1UL)               /*!< CSD SW_HS_P_SEL: SW_HMPM (Bitfield-Mask: 0x01)            */
#define CSD_SW_HS_P_SEL_SW_HMPT_Pos       (4UL)                 /*!< CSD SW_HS_P_SEL: SW_HMPT (Bit 4)                          */
#define CSD_SW_HS_P_SEL_SW_HMPT_Msk       (0x10UL)              /*!< CSD SW_HS_P_SEL: SW_HMPT (Bitfield-Mask: 0x01)            */
#define CSD_SW_HS_P_SEL_SW_HMPS_Pos       (8UL)                 /*!< CSD SW_HS_P_SEL: SW_HMPS (Bit 8)                          */
#define CSD_SW_HS_P_SEL_SW_HMPS_Msk       (0x100UL)             /*!< CSD SW_HS_P_SEL: SW_HMPS (Bitfield-Mask: 0x01)            */
#define CSD_SW_HS_P_SEL_SW_HMMA_Pos       (12UL)                /*!< CSD SW_HS_P_SEL: SW_HMMA (Bit 12)                         */
#define CSD_SW_HS_P_SEL_SW_HMMA_Msk       (0x1000UL)            /*!< CSD SW_HS_P_SEL: SW_HMMA (Bitfield-Mask: 0x01)            */
#define CSD_SW_HS_P_SEL_SW_HMMB_Pos       (16UL)                /*!< CSD SW_HS_P_SEL: SW_HMMB (Bit 16)                         */
#define CSD_SW_HS_P_SEL_SW_HMMB_Msk       (0x10000UL)           /*!< CSD SW_HS_P_SEL: SW_HMMB (Bitfield-Mask: 0x01)            */
#define CSD_SW_HS_P_SEL_SW_HMCA_Pos       (20UL)                /*!< CSD SW_HS_P_SEL: SW_HMCA (Bit 20)                         */
#define CSD_SW_HS_P_SEL_SW_HMCA_Msk       (0x100000UL)          /*!< CSD SW_HS_P_SEL: SW_HMCA (Bitfield-Mask: 0x01)            */
#define CSD_SW_HS_P_SEL_SW_HMCB_Pos       (24UL)                /*!< CSD SW_HS_P_SEL: SW_HMCB (Bit 24)                         */
#define CSD_SW_HS_P_SEL_SW_HMCB_Msk       (0x1000000UL)         /*!< CSD SW_HS_P_SEL: SW_HMCB (Bitfield-Mask: 0x01)            */
#define CSD_SW_HS_P_SEL_SW_HMRH_Pos       (28UL)                /*!< CSD SW_HS_P_SEL: SW_HMRH (Bit 28)                         */
#define CSD_SW_HS_P_SEL_SW_HMRH_Msk       (0x10000000UL)        /*!< CSD SW_HS_P_SEL: SW_HMRH (Bitfield-Mask: 0x01)            */
/* ====================================================  CSD.SW_HS_N_SEL  ==================================================== */
#define CSD_SW_HS_N_SEL_SW_HCCC_Pos       (16UL)                /*!< CSD SW_HS_N_SEL: SW_HCCC (Bit 16)                         */
#define CSD_SW_HS_N_SEL_SW_HCCC_Msk       (0x10000UL)           /*!< CSD SW_HS_N_SEL: SW_HCCC (Bitfield-Mask: 0x01)            */
#define CSD_SW_HS_N_SEL_SW_HCCD_Pos       (20UL)                /*!< CSD SW_HS_N_SEL: SW_HCCD (Bit 20)                         */
