ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_csd.h
#define CSD_SW_HS_N_SEL_SW_HCCD_Msk       (0x100000UL)          /*!< CSD SW_HS_N_SEL: SW_HCCD (Bitfield-Mask: 0x01)            */
#define CSD_SW_HS_N_SEL_SW_HCRH_Pos       (24UL)                /*!< CSD SW_HS_N_SEL: SW_HCRH (Bit 24)                         */
#define CSD_SW_HS_N_SEL_SW_HCRH_Msk       (0x7000000UL)         /*!< CSD SW_HS_N_SEL: SW_HCRH (Bitfield-Mask: 0x07)            */
#define CSD_SW_HS_N_SEL_SW_HCRL_Pos       (28UL)                /*!< CSD SW_HS_N_SEL: SW_HCRL (Bit 28)                         */
#define CSD_SW_HS_N_SEL_SW_HCRL_Msk       (0x70000000UL)        /*!< CSD SW_HS_N_SEL: SW_HCRL (Bitfield-Mask: 0x07)            */
/* ===================================================  CSD.SW_SHIELD_SEL  =================================================== */
#define CSD_SW_SHIELD_SEL_SW_HCAV_Pos     (0UL)                 /*!< CSD SW_SHIELD_SEL: SW_HCAV (Bit 0)                        */
#define CSD_SW_SHIELD_SEL_SW_HCAV_Msk     (0x7UL)               /*!< CSD SW_SHIELD_SEL: SW_HCAV (Bitfield-Mask: 0x07)          */
#define CSD_SW_SHIELD_SEL_SW_HCAG_Pos     (4UL)                 /*!< CSD SW_SHIELD_SEL: SW_HCAG (Bit 4)                        */
#define CSD_SW_SHIELD_SEL_SW_HCAG_Msk     (0x70UL)              /*!< CSD SW_SHIELD_SEL: SW_HCAG (Bitfield-Mask: 0x07)          */
#define CSD_SW_SHIELD_SEL_SW_HCBV_Pos     (8UL)                 /*!< CSD SW_SHIELD_SEL: SW_HCBV (Bit 8)                        */
#define CSD_SW_SHIELD_SEL_SW_HCBV_Msk     (0x700UL)             /*!< CSD SW_SHIELD_SEL: SW_HCBV (Bitfield-Mask: 0x07)          */
#define CSD_SW_SHIELD_SEL_SW_HCBG_Pos     (12UL)                /*!< CSD SW_SHIELD_SEL: SW_HCBG (Bit 12)                       */
#define CSD_SW_SHIELD_SEL_SW_HCBG_Msk     (0x7000UL)            /*!< CSD SW_SHIELD_SEL: SW_HCBG (Bitfield-Mask: 0x07)          */
#define CSD_SW_SHIELD_SEL_SW_HCCV_Pos     (16UL)                /*!< CSD SW_SHIELD_SEL: SW_HCCV (Bit 16)                       */
#define CSD_SW_SHIELD_SEL_SW_HCCV_Msk     (0x10000UL)           /*!< CSD SW_SHIELD_SEL: SW_HCCV (Bitfield-Mask: 0x01)          */
#define CSD_SW_SHIELD_SEL_SW_HCCG_Pos     (20UL)                /*!< CSD SW_SHIELD_SEL: SW_HCCG (Bit 20)                       */
#define CSD_SW_SHIELD_SEL_SW_HCCG_Msk     (0x100000UL)          /*!< CSD SW_SHIELD_SEL: SW_HCCG (Bitfield-Mask: 0x01)          */
/* ==================================================  CSD.SW_AMUXBUF_SEL  =================================================== */
#define CSD_SW_AMUXBUF_SEL_SW_IRBY_Pos    (4UL)                 /*!< CSD SW_AMUXBUF_SEL: SW_IRBY (Bit 4)                       */
#define CSD_SW_AMUXBUF_SEL_SW_IRBY_Msk    (0x10UL)              /*!< CSD SW_AMUXBUF_SEL: SW_IRBY (Bitfield-Mask: 0x01)         */
#define CSD_SW_AMUXBUF_SEL_SW_IRLB_Pos    (8UL)                 /*!< CSD SW_AMUXBUF_SEL: SW_IRLB (Bit 8)                       */
#define CSD_SW_AMUXBUF_SEL_SW_IRLB_Msk    (0x100UL)             /*!< CSD SW_AMUXBUF_SEL: SW_IRLB (Bitfield-Mask: 0x01)         */
#define CSD_SW_AMUXBUF_SEL_SW_ICA_Pos     (12UL)                /*!< CSD SW_AMUXBUF_SEL: SW_ICA (Bit 12)                       */
#define CSD_SW_AMUXBUF_SEL_SW_ICA_Msk     (0x1000UL)            /*!< CSD SW_AMUXBUF_SEL: SW_ICA (Bitfield-Mask: 0x01)          */
#define CSD_SW_AMUXBUF_SEL_SW_ICB_Pos     (16UL)                /*!< CSD SW_AMUXBUF_SEL: SW_ICB (Bit 16)                       */
#define CSD_SW_AMUXBUF_SEL_SW_ICB_Msk     (0x70000UL)           /*!< CSD SW_AMUXBUF_SEL: SW_ICB (Bitfield-Mask: 0x07)          */
#define CSD_SW_AMUXBUF_SEL_SW_IRLI_Pos    (20UL)                /*!< CSD SW_AMUXBUF_SEL: SW_IRLI (Bit 20)                      */
#define CSD_SW_AMUXBUF_SEL_SW_IRLI_Msk    (0x100000UL)          /*!< CSD SW_AMUXBUF_SEL: SW_IRLI (Bitfield-Mask: 0x01)         */
#define CSD_SW_AMUXBUF_SEL_SW_IRH_Pos     (24UL)                /*!< CSD SW_AMUXBUF_SEL: SW_IRH (Bit 24)                       */
#define CSD_SW_AMUXBUF_SEL_SW_IRH_Msk     (0x1000000UL)         /*!< CSD SW_AMUXBUF_SEL: SW_IRH (Bitfield-Mask: 0x01)          */
#define CSD_SW_AMUXBUF_SEL_SW_IRL_Pos     (28UL)                /*!< CSD SW_AMUXBUF_SEL: SW_IRL (Bit 28)                       */
#define CSD_SW_AMUXBUF_SEL_SW_IRL_Msk     (0x10000000UL)        /*!< CSD SW_AMUXBUF_SEL: SW_IRL (Bitfield-Mask: 0x01)          */
/* ====================================================  CSD.SW_BYP_SEL  ===================================================== */
#define CSD_SW_BYP_SEL_SW_BYA_Pos         (12UL)                /*!< CSD SW_BYP_SEL: SW_BYA (Bit 12)                           */
#define CSD_SW_BYP_SEL_SW_BYA_Msk         (0x1000UL)            /*!< CSD SW_BYP_SEL: SW_BYA (Bitfield-Mask: 0x01)              */
#define CSD_SW_BYP_SEL_SW_BYB_Pos         (16UL)                /*!< CSD SW_BYP_SEL: SW_BYB (Bit 16)                           */
#define CSD_SW_BYP_SEL_SW_BYB_Msk         (0x10000UL)           /*!< CSD SW_BYP_SEL: SW_BYB (Bitfield-Mask: 0x01)              */
#define CSD_SW_BYP_SEL_SW_CBCC_Pos        (20UL)                /*!< CSD SW_BYP_SEL: SW_CBCC (Bit 20)                          */
#define CSD_SW_BYP_SEL_SW_CBCC_Msk        (0x100000UL)          /*!< CSD SW_BYP_SEL: SW_CBCC (Bitfield-Mask: 0x01)             */
/* ===================================================  CSD.SW_CMP_P_SEL  ==================================================== */
#define CSD_SW_CMP_P_SEL_SW_SFPM_Pos      (0UL)                 /*!< CSD SW_CMP_P_SEL: SW_SFPM (Bit 0)                         */
#define CSD_SW_CMP_P_SEL_SW_SFPM_Msk      (0x7UL)               /*!< CSD SW_CMP_P_SEL: SW_SFPM (Bitfield-Mask: 0x07)           */
#define CSD_SW_CMP_P_SEL_SW_SFPT_Pos      (4UL)                 /*!< CSD SW_CMP_P_SEL: SW_SFPT (Bit 4)                         */
#define CSD_SW_CMP_P_SEL_SW_SFPT_Msk      (0x70UL)              /*!< CSD SW_CMP_P_SEL: SW_SFPT (Bitfield-Mask: 0x07)           */
#define CSD_SW_CMP_P_SEL_SW_SFPS_Pos      (8UL)                 /*!< CSD SW_CMP_P_SEL: SW_SFPS (Bit 8)                         */
#define CSD_SW_CMP_P_SEL_SW_SFPS_Msk      (0x700UL)             /*!< CSD SW_CMP_P_SEL: SW_SFPS (Bitfield-Mask: 0x07)           */
#define CSD_SW_CMP_P_SEL_SW_SFMA_Pos      (12UL)                /*!< CSD SW_CMP_P_SEL: SW_SFMA (Bit 12)                        */
#define CSD_SW_CMP_P_SEL_SW_SFMA_Msk      (0x1000UL)            /*!< CSD SW_CMP_P_SEL: SW_SFMA (Bitfield-Mask: 0x01)           */
#define CSD_SW_CMP_P_SEL_SW_SFMB_Pos      (16UL)                /*!< CSD SW_CMP_P_SEL: SW_SFMB (Bit 16)                        */
#define CSD_SW_CMP_P_SEL_SW_SFMB_Msk      (0x10000UL)           /*!< CSD SW_CMP_P_SEL: SW_SFMB (Bitfield-Mask: 0x01)           */
#define CSD_SW_CMP_P_SEL_SW_SFCA_Pos      (20UL)                /*!< CSD SW_CMP_P_SEL: SW_SFCA (Bit 20)                        */
#define CSD_SW_CMP_P_SEL_SW_SFCA_Msk      (0x100000UL)          /*!< CSD SW_CMP_P_SEL: SW_SFCA (Bitfield-Mask: 0x01)           */
#define CSD_SW_CMP_P_SEL_SW_SFCB_Pos      (24UL)                /*!< CSD SW_CMP_P_SEL: SW_SFCB (Bit 24)                        */
#define CSD_SW_CMP_P_SEL_SW_SFCB_Msk      (0x1000000UL)         /*!< CSD SW_CMP_P_SEL: SW_SFCB (Bitfield-Mask: 0x01)           */
/* ===================================================  CSD.SW_CMP_N_SEL  ==================================================== */
#define CSD_SW_CMP_N_SEL_SW_SCRH_Pos      (24UL)                /*!< CSD SW_CMP_N_SEL: SW_SCRH (Bit 24)                        */
#define CSD_SW_CMP_N_SEL_SW_SCRH_Msk      (0x7000000UL)         /*!< CSD SW_CMP_N_SEL: SW_SCRH (Bitfield-Mask: 0x07)           */
#define CSD_SW_CMP_N_SEL_SW_SCRL_Pos      (28UL)                /*!< CSD SW_CMP_N_SEL: SW_SCRL (Bit 28)                        */
#define CSD_SW_CMP_N_SEL_SW_SCRL_Msk      (0x70000000UL)        /*!< CSD SW_CMP_N_SEL: SW_SCRL (Bitfield-Mask: 0x07)           */
/* ===================================================  CSD.SW_REFGEN_SEL  =================================================== */
#define CSD_SW_REFGEN_SEL_SW_IAIB_Pos     (0UL)                 /*!< CSD SW_REFGEN_SEL: SW_IAIB (Bit 0)                        */
#define CSD_SW_REFGEN_SEL_SW_IAIB_Msk     (0x1UL)               /*!< CSD SW_REFGEN_SEL: SW_IAIB (Bitfield-Mask: 0x01)          */
#define CSD_SW_REFGEN_SEL_SW_IBCB_Pos     (4UL)                 /*!< CSD SW_REFGEN_SEL: SW_IBCB (Bit 4)                        */
#define CSD_SW_REFGEN_SEL_SW_IBCB_Msk     (0x10UL)              /*!< CSD SW_REFGEN_SEL: SW_IBCB (Bitfield-Mask: 0x01)          */
#define CSD_SW_REFGEN_SEL_SW_SGMB_Pos     (16UL)                /*!< CSD SW_REFGEN_SEL: SW_SGMB (Bit 16)                       */
#define CSD_SW_REFGEN_SEL_SW_SGMB_Msk     (0x10000UL)           /*!< CSD SW_REFGEN_SEL: SW_SGMB (Bitfield-Mask: 0x01)          */
#define CSD_SW_REFGEN_SEL_SW_SGRP_Pos     (20UL)                /*!< CSD SW_REFGEN_SEL: SW_SGRP (Bit 20)                       */
#define CSD_SW_REFGEN_SEL_SW_SGRP_Msk     (0x100000UL)          /*!< CSD SW_REFGEN_SEL: SW_SGRP (Bitfield-Mask: 0x01)          */
#define CSD_SW_REFGEN_SEL_SW_SGRE_Pos     (24UL)                /*!< CSD SW_REFGEN_SEL: SW_SGRE (Bit 24)                       */
#define CSD_SW_REFGEN_SEL_SW_SGRE_Msk     (0x1000000UL)         /*!< CSD SW_REFGEN_SEL: SW_SGRE (Bitfield-Mask: 0x01)          */
#define CSD_SW_REFGEN_SEL_SW_SGR_Pos      (28UL)                /*!< CSD SW_REFGEN_SEL: SW_SGR (Bit 28)                        */
#define CSD_SW_REFGEN_SEL_SW_SGR_Msk      (0x10000000UL)        /*!< CSD SW_REFGEN_SEL: SW_SGR (Bitfield-Mask: 0x01)           */
/* ===================================================  CSD.SW_FW_MOD_SEL  =================================================== */
#define CSD_SW_FW_MOD_SEL_SW_F1PM_Pos     (0UL)                 /*!< CSD SW_FW_MOD_SEL: SW_F1PM (Bit 0)                        */
#define CSD_SW_FW_MOD_SEL_SW_F1PM_Msk     (0x1UL)               /*!< CSD SW_FW_MOD_SEL: SW_F1PM (Bitfield-Mask: 0x01)          */
#define CSD_SW_FW_MOD_SEL_SW_F1MA_Pos     (8UL)                 /*!< CSD SW_FW_MOD_SEL: SW_F1MA (Bit 8)                        */
#define CSD_SW_FW_MOD_SEL_SW_F1MA_Msk     (0x700UL)             /*!< CSD SW_FW_MOD_SEL: SW_F1MA (Bitfield-Mask: 0x07)          */
#define CSD_SW_FW_MOD_SEL_SW_F1CA_Pos     (16UL)                /*!< CSD SW_FW_MOD_SEL: SW_F1CA (Bit 16)                       */
#define CSD_SW_FW_MOD_SEL_SW_F1CA_Msk     (0x70000UL)           /*!< CSD SW_FW_MOD_SEL: SW_F1CA (Bitfield-Mask: 0x07)          */
#define CSD_SW_FW_MOD_SEL_SW_C1CC_Pos     (20UL)                /*!< CSD SW_FW_MOD_SEL: SW_C1CC (Bit 20)                       */
#define CSD_SW_FW_MOD_SEL_SW_C1CC_Msk     (0x100000UL)          /*!< CSD SW_FW_MOD_SEL: SW_C1CC (Bitfield-Mask: 0x01)          */
#define CSD_SW_FW_MOD_SEL_SW_C1CD_Pos     (24UL)                /*!< CSD SW_FW_MOD_SEL: SW_C1CD (Bit 24)                       */
#define CSD_SW_FW_MOD_SEL_SW_C1CD_Msk     (0x1000000UL)         /*!< CSD SW_FW_MOD_SEL: SW_C1CD (Bitfield-Mask: 0x01)          */
#define CSD_SW_FW_MOD_SEL_SW_C1F1_Pos     (28UL)                /*!< CSD SW_FW_MOD_SEL: SW_C1F1 (Bit 28)                       */
#define CSD_SW_FW_MOD_SEL_SW_C1F1_Msk     (0x10000000UL)        /*!< CSD SW_FW_MOD_SEL: SW_C1F1 (Bitfield-Mask: 0x01)          */
/* ==================================================  CSD.SW_FW_TANK_SEL  =================================================== */
#define CSD_SW_FW_TANK_SEL_SW_F2PT_Pos    (4UL)                 /*!< CSD SW_FW_TANK_SEL: SW_F2PT (Bit 4)                       */
#define CSD_SW_FW_TANK_SEL_SW_F2PT_Msk    (0x10UL)              /*!< CSD SW_FW_TANK_SEL: SW_F2PT (Bitfield-Mask: 0x01)         */
#define CSD_SW_FW_TANK_SEL_SW_F2MA_Pos    (8UL)                 /*!< CSD SW_FW_TANK_SEL: SW_F2MA (Bit 8)                       */
#define CSD_SW_FW_TANK_SEL_SW_F2MA_Msk    (0x700UL)             /*!< CSD SW_FW_TANK_SEL: SW_F2MA (Bitfield-Mask: 0x07)         */
#define CSD_SW_FW_TANK_SEL_SW_F2CA_Pos    (12UL)                /*!< CSD SW_FW_TANK_SEL: SW_F2CA (Bit 12)                      */
#define CSD_SW_FW_TANK_SEL_SW_F2CA_Msk    (0x7000UL)            /*!< CSD SW_FW_TANK_SEL: SW_F2CA (Bitfield-Mask: 0x07)         */
#define CSD_SW_FW_TANK_SEL_SW_F2CB_Pos    (16UL)                /*!< CSD SW_FW_TANK_SEL: SW_F2CB (Bit 16)                      */
#define CSD_SW_FW_TANK_SEL_SW_F2CB_Msk    (0x70000UL)           /*!< CSD SW_FW_TANK_SEL: SW_F2CB (Bitfield-Mask: 0x07)         */
#define CSD_SW_FW_TANK_SEL_SW_C2CC_Pos    (20UL)                /*!< CSD SW_FW_TANK_SEL: SW_C2CC (Bit 20)                      */
#define CSD_SW_FW_TANK_SEL_SW_C2CC_Msk    (0x100000UL)          /*!< CSD SW_FW_TANK_SEL: SW_C2CC (Bitfield-Mask: 0x01)         */
#define CSD_SW_FW_TANK_SEL_SW_C2CD_Pos    (24UL)                /*!< CSD SW_FW_TANK_SEL: SW_C2CD (Bit 24)                      */
#define CSD_SW_FW_TANK_SEL_SW_C2CD_Msk    (0x1000000UL)         /*!< CSD SW_FW_TANK_SEL: SW_C2CD (Bitfield-Mask: 0x01)         */
#define CSD_SW_FW_TANK_SEL_SW_C2F2_Pos    (28UL)                /*!< CSD SW_FW_TANK_SEL: SW_C2F2 (Bit 28)                      */
#define CSD_SW_FW_TANK_SEL_SW_C2F2_Msk    (0x10000000UL)        /*!< CSD SW_FW_TANK_SEL: SW_C2F2 (Bitfield-Mask: 0x01)         */
/* ====================================================  CSD.SW_DSI_SEL  ===================================================== */
#define CSD_SW_DSI_SEL_DSI_CSH_TANK_Pos   (0UL)                 /*!< CSD SW_DSI_SEL: DSI_CSH_TANK (Bit 0)                      */
#define CSD_SW_DSI_SEL_DSI_CSH_TANK_Msk   (0xfUL)               /*!< CSD SW_DSI_SEL: DSI_CSH_TANK (Bitfield-Mask: 0x0f)        */
#define CSD_SW_DSI_SEL_DSI_CMOD_Pos       (4UL)                 /*!< CSD SW_DSI_SEL: DSI_CMOD (Bit 4)                          */
#define CSD_SW_DSI_SEL_DSI_CMOD_Msk       (0xf0UL)              /*!< CSD SW_DSI_SEL: DSI_CMOD (Bitfield-Mask: 0x0f)            */
/* ======================================================  CSD.IO_SEL  ======================================================= */
#define CSD_IO_SEL_CSD_TX_OUT_Pos         (0UL)                 /*!< CSD IO_SEL: CSD_TX_OUT (Bit 0)                            */
#define CSD_IO_SEL_CSD_TX_OUT_Msk         (0xfUL)               /*!< CSD IO_SEL: CSD_TX_OUT (Bitfield-Mask: 0x0f)              */
#define CSD_IO_SEL_CSD_TX_OUT_EN_Pos      (4UL)                 /*!< CSD IO_SEL: CSD_TX_OUT_EN (Bit 4)                         */
#define CSD_IO_SEL_CSD_TX_OUT_EN_Msk      (0xf0UL)              /*!< CSD IO_SEL: CSD_TX_OUT_EN (Bitfield-Mask: 0x0f)           */
#define CSD_IO_SEL_CSD_TX_AMUXB_EN_Pos    (12UL)                /*!< CSD IO_SEL: CSD_TX_AMUXB_EN (Bit 12)                      */
#define CSD_IO_SEL_CSD_TX_AMUXB_EN_Msk    (0xf000UL)            /*!< CSD IO_SEL: CSD_TX_AMUXB_EN (Bitfield-Mask: 0x0f)         */
#define CSD_IO_SEL_CSD_TX_N_OUT_Pos       (16UL)                /*!< CSD IO_SEL: CSD_TX_N_OUT (Bit 16)                         */
#define CSD_IO_SEL_CSD_TX_N_OUT_Msk       (0xf0000UL)           /*!< CSD IO_SEL: CSD_TX_N_OUT (Bitfield-Mask: 0x0f)            */
#define CSD_IO_SEL_CSD_TX_N_OUT_EN_Pos    (20UL)                /*!< CSD IO_SEL: CSD_TX_N_OUT_EN (Bit 20)                      */
#define CSD_IO_SEL_CSD_TX_N_OUT_EN_Msk    (0xf00000UL)          /*!< CSD IO_SEL: CSD_TX_N_OUT_EN (Bitfield-Mask: 0x0f)         */
#define CSD_IO_SEL_CSD_TX_N_AMUXA_EN_Pos  (24UL)                /*!< CSD IO_SEL: CSD_TX_N_AMUXA_EN (Bit 24)                    */
#define CSD_IO_SEL_CSD_TX_N_AMUXA_EN_Msk  (0xf000000UL)         /*!< CSD IO_SEL: CSD_TX_N_AMUXA_EN (Bitfield-Mask: 0x0f)       */
/* =====================================================  CSD.SEQ_TIME  ====================================================== */
#define CSD_SEQ_TIME_AZ_TIME_Pos          (0UL)                 /*!< CSD SEQ_TIME: AZ_TIME (Bit 0)                             */
#define CSD_SEQ_TIME_AZ_TIME_Msk          (0xffUL)              /*!< CSD SEQ_TIME: AZ_TIME (Bitfield-Mask: 0xff)               */
/* ===================================================  CSD.SEQ_INIT_CNT  ==================================================== */
#define CSD_SEQ_INIT_CNT_CONV_CNT_Pos     (0UL)                 /*!< CSD SEQ_INIT_CNT: CONV_CNT (Bit 0)                        */
#define CSD_SEQ_INIT_CNT_CONV_CNT_Msk     (0xffffUL)            /*!< CSD SEQ_INIT_CNT: CONV_CNT (Bitfield-Mask: 0xffff)        */
/* ===================================================  CSD.SEQ_NORM_CNT  ==================================================== */
#define CSD_SEQ_NORM_CNT_CONV_CNT_Pos     (0UL)                 /*!< CSD SEQ_NORM_CNT: CONV_CNT (Bit 0)                        */
#define CSD_SEQ_NORM_CNT_CONV_CNT_Msk     (0xffffUL)            /*!< CSD SEQ_NORM_CNT: CONV_CNT (Bitfield-Mask: 0xffff)        */
/* ======================================================  CSD.ADC_CTL  ====================================================== */
#define CSD_ADC_CTL_ADC_TIME_Pos          (0UL)                 /*!< CSD ADC_CTL: ADC_TIME (Bit 0)                             */
#define CSD_ADC_CTL_ADC_TIME_Msk          (0xffUL)              /*!< CSD ADC_CTL: ADC_TIME (Bitfield-Mask: 0xff)               */
#define CSD_ADC_CTL_ADC_MODE_Pos          (16UL)                /*!< CSD ADC_CTL: ADC_MODE (Bit 16)                            */
#define CSD_ADC_CTL_ADC_MODE_Msk          (0x30000UL)           /*!< CSD ADC_CTL: ADC_MODE (Bitfield-Mask: 0x03)               */
/* =====================================================  CSD.SEQ_START  ===================================================== */
#define CSD_SEQ_START_START_Pos           (0UL)                 /*!< CSD SEQ_START: START (Bit 0)                              */
#define CSD_SEQ_START_START_Msk           (0x1UL)               /*!< CSD SEQ_START: START (Bitfield-Mask: 0x01)                */
#define CSD_SEQ_START_SEQ_MODE_Pos        (1UL)                 /*!< CSD SEQ_START: SEQ_MODE (Bit 1)                           */
#define CSD_SEQ_START_SEQ_MODE_Msk        (0x2UL)               /*!< CSD SEQ_START: SEQ_MODE (Bitfield-Mask: 0x01)             */
#define CSD_SEQ_START_ABORT_Pos           (3UL)                 /*!< CSD SEQ_START: ABORT (Bit 3)                              */
#define CSD_SEQ_START_ABORT_Msk           (0x8UL)               /*!< CSD SEQ_START: ABORT (Bitfield-Mask: 0x01)                */
#define CSD_SEQ_START_DSI_START_EN_Pos    (4UL)                 /*!< CSD SEQ_START: DSI_START_EN (Bit 4)                       */
#define CSD_SEQ_START_DSI_START_EN_Msk    (0x10UL)              /*!< CSD SEQ_START: DSI_START_EN (Bitfield-Mask: 0x01)         */
#define CSD_SEQ_START_AZ0_SKIP_Pos        (8UL)                 /*!< CSD SEQ_START: AZ0_SKIP (Bit 8)                           */
#define CSD_SEQ_START_AZ0_SKIP_Msk        (0x100UL)             /*!< CSD SEQ_START: AZ0_SKIP (Bitfield-Mask: 0x01)             */
#define CSD_SEQ_START_AZ1_SKIP_Pos        (9UL)                 /*!< CSD SEQ_START: AZ1_SKIP (Bit 9)                           */
#define CSD_SEQ_START_AZ1_SKIP_Msk        (0x200UL)             /*!< CSD SEQ_START: AZ1_SKIP (Bitfield-Mask: 0x01)             */
/* =======================================================  CSD.IDACA  ======================================================= */
#define CSD_IDACA_VAL_Pos                 (0UL)                 /*!< CSD IDACA: VAL (Bit 0)                                    */
#define CSD_IDACA_VAL_Msk                 (0x7fUL)              /*!< CSD IDACA: VAL (Bitfield-Mask: 0x7f)                      */
#define CSD_IDACA_POL_DYN_Pos             (7UL)                 /*!< CSD IDACA: POL_DYN (Bit 7)                                */
#define CSD_IDACA_POL_DYN_Msk             (0x80UL)              /*!< CSD IDACA: POL_DYN (Bitfield-Mask: 0x01)                  */
#define CSD_IDACA_POLARITY_Pos            (8UL)                 /*!< CSD IDACA: POLARITY (Bit 8)                               */
#define CSD_IDACA_POLARITY_Msk            (0x300UL)             /*!< CSD IDACA: POLARITY (Bitfield-Mask: 0x03)                 */
#define CSD_IDACA_BAL_MODE_Pos            (10UL)                /*!< CSD IDACA: BAL_MODE (Bit 10)                              */
#define CSD_IDACA_BAL_MODE_Msk            (0xc00UL)             /*!< CSD IDACA: BAL_MODE (Bitfield-Mask: 0x03)                 */
#define CSD_IDACA_LEG1_MODE_Pos           (16UL)                /*!< CSD IDACA: LEG1_MODE (Bit 16)                             */
#define CSD_IDACA_LEG1_MODE_Msk           (0x30000UL)           /*!< CSD IDACA: LEG1_MODE (Bitfield-Mask: 0x03)                */
#define CSD_IDACA_LEG2_MODE_Pos           (18UL)                /*!< CSD IDACA: LEG2_MODE (Bit 18)                             */
#define CSD_IDACA_LEG2_MODE_Msk           (0xc0000UL)           /*!< CSD IDACA: LEG2_MODE (Bitfield-Mask: 0x03)                */
#define CSD_IDACA_DSI_CTRL_EN_Pos         (21UL)                /*!< CSD IDACA: DSI_CTRL_EN (Bit 21)                           */
#define CSD_IDACA_DSI_CTRL_EN_Msk         (0x200000UL)          /*!< CSD IDACA: DSI_CTRL_EN (Bitfield-Mask: 0x01)              */
#define CSD_IDACA_RANGE_Pos               (22UL)                /*!< CSD IDACA: RANGE (Bit 22)                                 */
#define CSD_IDACA_RANGE_Msk               (0xc00000UL)          /*!< CSD IDACA: RANGE (Bitfield-Mask: 0x03)                    */
#define CSD_IDACA_LEG1_EN_Pos             (24UL)                /*!< CSD IDACA: LEG1_EN (Bit 24)                               */
#define CSD_IDACA_LEG1_EN_Msk             (0x1000000UL)         /*!< CSD IDACA: LEG1_EN (Bitfield-Mask: 0x01)                  */
#define CSD_IDACA_LEG2_EN_Pos             (25UL)                /*!< CSD IDACA: LEG2_EN (Bit 25)                               */
#define CSD_IDACA_LEG2_EN_Msk             (0x2000000UL)         /*!< CSD IDACA: LEG2_EN (Bitfield-Mask: 0x01)                  */
/* =======================================================  CSD.IDACB  ======================================================= */
#define CSD_IDACB_VAL_Pos                 (0UL)                 /*!< CSD IDACB: VAL (Bit 0)                                    */
#define CSD_IDACB_VAL_Msk                 (0x7fUL)              /*!< CSD IDACB: VAL (Bitfield-Mask: 0x7f)                      */
#define CSD_IDACB_POL_DYN_Pos             (7UL)                 /*!< CSD IDACB: POL_DYN (Bit 7)                                */
#define CSD_IDACB_POL_DYN_Msk             (0x80UL)              /*!< CSD IDACB: POL_DYN (Bitfield-Mask: 0x01)                  */
#define CSD_IDACB_POLARITY_Pos            (8UL)                 /*!< CSD IDACB: POLARITY (Bit 8)                               */
#define CSD_IDACB_POLARITY_Msk            (0x300UL)             /*!< CSD IDACB: POLARITY (Bitfield-Mask: 0x03)                 */
#define CSD_IDACB_BAL_MODE_Pos            (10UL)                /*!< CSD IDACB: BAL_MODE (Bit 10)                              */
#define CSD_IDACB_BAL_MODE_Msk            (0xc00UL)             /*!< CSD IDACB: BAL_MODE (Bitfield-Mask: 0x03)                 */
#define CSD_IDACB_LEG1_MODE_Pos           (16UL)                /*!< CSD IDACB: LEG1_MODE (Bit 16)                             */
#define CSD_IDACB_LEG1_MODE_Msk           (0x30000UL)           /*!< CSD IDACB: LEG1_MODE (Bitfield-Mask: 0x03)                */
#define CSD_IDACB_LEG2_MODE_Pos           (18UL)                /*!< CSD IDACB: LEG2_MODE (Bit 18)                             */
#define CSD_IDACB_LEG2_MODE_Msk           (0xc0000UL)           /*!< CSD IDACB: LEG2_MODE (Bitfield-Mask: 0x03)                */
#define CSD_IDACB_DSI_CTRL_EN_Pos         (21UL)                /*!< CSD IDACB: DSI_CTRL_EN (Bit 21)                           */
#define CSD_IDACB_DSI_CTRL_EN_Msk         (0x200000UL)          /*!< CSD IDACB: DSI_CTRL_EN (Bitfield-Mask: 0x01)              */
#define CSD_IDACB_RANGE_Pos               (22UL)                /*!< CSD IDACB: RANGE (Bit 22)                                 */
#define CSD_IDACB_RANGE_Msk               (0xc00000UL)          /*!< CSD IDACB: RANGE (Bitfield-Mask: 0x03)                    */
#define CSD_IDACB_LEG1_EN_Pos             (24UL)                /*!< CSD IDACB: LEG1_EN (Bit 24)                               */
#define CSD_IDACB_LEG1_EN_Msk             (0x1000000UL)         /*!< CSD IDACB: LEG1_EN (Bitfield-Mask: 0x01)                  */
#define CSD_IDACB_LEG2_EN_Pos             (25UL)                /*!< CSD IDACB: LEG2_EN (Bit 25)                               */
#define CSD_IDACB_LEG2_EN_Msk             (0x2000000UL)         /*!< CSD IDACB: LEG2_EN (Bitfield-Mask: 0x01)                  */
#define CSD_IDACB_LEG3_EN_Pos             (26UL)                /*!< CSD IDACB: LEG3_EN (Bit 26)                               */
#define CSD_IDACB_LEG3_EN_Msk             (0x4000000UL)         /*!< CSD IDACB: LEG3_EN (Bitfield-Mask: 0x01)                  */


#endif /* _CYIP_CSD_H_ */


/* [] END OF FILE */
